app/controllers/posts_controller.rb

def create
  Post.create(title: params[:post][:title], description: params[:post][:description])
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-09-22 04:34:21.266989"], ["updated_at", "2018-09-22 04:34:21.266989"]]